Catalogs/ТипыСкидокНаценок/ТипыСкидокНаценок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыСкидокНаценок</name>
  <comment>(Упр)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Архив</name>
      <description>Архив</description>
    </items>
  </predefined>
  <attributes>
    <name>Валюта</name>
    <comment>(Общ) Валюта, в которой задана скидка </comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляВсейНоменклатуры</name>
    <comment>Удалить (Общ) Истина -  скидка действует для всех номенклатурных позиций, иначе - только для заданных в регистре сведений Скидки</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентСкидкиНаценки</name>
    <comment>(Общ) Процент скидки по умолчанию (сумма или процент)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеУсловия</name>
    <comment>(Общ) Значение условия скидки</comment>
    <type>
      <types>Number</types>
      <types>CatalogRef.ВидыОплатЧекаККМ</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщееВремяНачала</name>
    <comment>(Общее время начала действия скидки)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщееВремяОкончания</name>
    <comment>(Общее время окончания действия скидки)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОграничениеСкидкиНаценки</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Условие</name>
    <comment>(Общ) Условие скидки-наценки</comment>
    <type>
      <types>EnumRef.УсловияСкидкиНаценки</types>
    </type>
  </attributes>
  <attributes>
    <name>Качество</name>
    <type>
      <types>CatalogRef.Качество</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляВсехПолучателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоДнямНедели</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСкидки</name>
    <type>
      <types>EnumRef.ВидыСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_УсловиеДляСкидкиКоличеством</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_СкидкаКоличеством</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_СкидкаСуммой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПрименятьСкидкуДоОграничения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДатаНачалаНакопления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_НазначаетсяВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_СтатьяОборотовПоБюджету</name>
    <type>
      <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ТипАкции</name>
    <type>
      <types>CatalogRef.Лео_ТипАкции</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_НаправлениеРасхода</name>
    <type>
      <types>CatalogRef.Лео_ТипСкидкиНаправлениеРасхода</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВремяПоДнямНедели</name>
    <comment>(Общ) Время действия скидки</comment>
    <attributes>
      <name>Выбран</name>
      <comment>(Общ) Признак выбранного дня недели</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДеньНедели</name>
      <comment>(Общ) День недели</comment>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <comment>(Общ) Время начала действия скидки</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <comment>(Общ) Время окончания действия скидки</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Enums/ВидыСкидок/ВидыСкидок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСкидок</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Оптовая</name>
  </enumValues>
  <enumValues>
    <name>Розничная</name>
  </enumValues>
</mdclass:Enum>

Enums/УсловияСкидкиНаценки/УсловияСкидкиНаценки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УсловияСкидкиНаценки</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>ПоВидуОплаты</name>
  </enumValues>
  <enumValues>
    <name>ПоДисконтнойКарте</name>
  </enumValues>
  <enumValues>
    <name>ПоКоличествуТовара</name>
  </enumValues>
  <enumValues>
    <name>ПоСуммеДокумента</name>
  </enumValues>
  <enumValues>
    <name>РучнаяСкидка</name>
  </enumValues>
  <enumValues>
    <name>БезУсловий</name>
    <comment>Скидка (наценка) процентом</comment>
  </enumValues>
  <enumValues>
    <name>СпецПредложение</name>
  </enumValues>
  <enumValues>
    <name>ПоВидуДисконтныхКарт</name>
  </enumValues>
  <enumValues>
    <name>абс_СуммойНаДокумент</name>
    <comment>Скидка (наценка) суммой на документ</comment>
  </enumValues>
  <enumValues>
    <name>абс_Количеством</name>
    <comment>Скидка количеством</comment>
  </enumValues>
  <enumValues>
    <name>абс_СпециальнаяЦена</name>
    <comment>Специальная цена</comment>
  </enumValues>
  <enumValues>
    <name>абс_ПроцентомСОграничением</name>
  </enumValues>
</mdclass:Enum>

Catalogs/ТипыСкидокНаценок/Forms/ФормаЭлементаУправляемая/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	Если ЭтотОбъект.ЭтоНовый() Тогда
		Объект.Валюта = глЗначениеПеременной("ВалютаУправленческогоУчета");
		Объект.ВидСкидки = Перечисления.ВидыСкидок.Оптовая;
		Объект.Условие = Перечисления.УсловияСкидкиНаценки.БезУсловий;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УсловиеПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Если Объект.Условие = Перечисления.УсловияСкидкиНаценки.БезУсловий Тогда
		Элементы.ГруппаСкидкаКоличеством.Видимость = Ложь;
		Элементы.ГруппаСкидкаПроцентом.Видимость = Истина;
		Элементы.ГруппаСкидкаСуммой.Видимость = Ложь;
		Элементы.ГруппаСпециальнаяЦена.Видимость = Ложь;
		Элементы.ОграничениеСкидкиНаценки.Видимость = Ложь;
		Элементы.абс_ПрименятьСкидкуДоОграничения.Видимость = Ложь;
		Элементы.абс_ДатаНачалаНакопления.Видимость = Ложь;
	ИначеЕсли Объект.Условие = Перечисления.УсловияСкидкиНаценки.абс_ПроцентомСОграничением Тогда 
		Элементы.ГруппаСкидкаКоличеством.Видимость = Ложь;
		Элементы.ГруппаСкидкаПроцентом.Видимость = Истина;
		Элементы.ГруппаСкидкаСуммой.Видимость = Ложь;
		Элементы.ГруппаСпециальнаяЦена.Видимость = Ложь;
		Элементы.ОграничениеСкидкиНаценки.Видимость = Истина;
		Элементы.абс_ПрименятьСкидкуДоОграничения.Видимость = Истина;
		Элементы.абс_ДатаНачалаНакопления.Видимость = Истина;
	ИначеЕсли Объект.Условие = Перечисления.УсловияСкидкиНаценки.абс_Количеством Тогда 
		Элементы.ГруппаСкидкаКоличеством.Видимость = Истина;
		Элементы.ГруппаСкидкаПроцентом.Видимость = Ложь;
		Элементы.ГруппаСкидкаСуммой.Видимость = Ложь;
		Элементы.ГруппаСпециальнаяЦена.Видимость = Ложь;
	ИначеЕсли Объект.Условие = Перечисления.УсловияСкидкиНаценки.абс_СуммойНаДокумент Тогда
		Элементы.ГруппаСкидкаКоличеством.Видимость = Ложь;
		Элементы.ГруппаСкидкаПроцентом.Видимость = Ложь;
		Элементы.ГруппаСкидкаСуммой.Видимость = Истина;
		Элементы.ГруппаСпециальнаяЦена.Видимость = Ложь;
	ИначеЕсли Объект.Условие = Перечисления.УсловияСкидкиНаценки.абс_СпециальнаяЦена Тогда
		Элементы.ГруппаСкидкаКоличеством.Видимость = Ложь;
		Элементы.ГруппаСкидкаПроцентом.Видимость = Ложь;
		Элементы.ГруппаСкидкаСуммой.Видимость = Ложь;
		Элементы.ГруппаСпециальнаяЦена.Видимость = Истина;
	Иначе
		Элементы.ГруппаСкидкаКоличеством.Видимость = Ложь;
		Элементы.ГруппаСкидкаПроцентом.Видимость = Ложь;
		Элементы.ГруппаСкидкаСуммой.Видимость = Ложь;
		Элементы.ГруппаСпециальнаяЦена.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры
